<a href="https://colab.research.google.com/github/Yamini584/Churn-Prediction/blob/main/Churn_Prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importing Dataset & Libraries

In [ ]:
import pandas as pd
df=pd.read_csv("/content/drive/MyDrive/Colab Notebooks/ML Practice/Logistic regression example/churn_prediction.csv")

Viewing the first 5 values in dataset

In [ ]:
df.head()

   customer_id  vintage  age  ... previous_month_balance  churn last_transaction
0            1     2101   66  ...                1458.71      0       2019-05-21
1            2     2348   35  ...                8787.61      0       2019-11-01
2            4     2194   31  ...                5070.14      0              NaT
3            5     2329   90  ...                1669.79      1       2019-08-06
4            6     1579   42  ...                1677.16      1       2019-11-03

[5 rows x 21 columns]

Summary of dataset

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28382 entries, 0 to 28381
Data columns (total 21 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   customer_id                     28382 non-null  int64
 1   vintage                         28382 non-null  int64
 2   age                             28382 non-null  int64
 3   gender                          27857 non-null  object
 4   dependents                      25919 non-null  float64
 5   occupation                      28302 non-null  object
 6   city                            27579 non-null  float64
 7   customer_nw_category            28382 non-null  int64
 8   branch_code                     28382 non-null  int64
 9   current_balance                 28382 non-null  float64
 10  previous_month_end_balance      28382 non-null  float64
 11  average_monthly_balance_prevQ   28382 non-null  float64
 12  average_monthly_balance_prevQ2  28382 non-null  float64
 13  current_month_credit            28382 non-null  float64
 14  previous_month_credit           28382 non-null  float64
 15  current_month_debit             28382 non-null  float64
 16  previous_month_debit            28382 non-null  float64
 17  current_month_balance           28382 non-null  float64
 18  previous_month_balance          28382 non-null  float64
 19  churn                           28382 non-null  int64
 20  last_transaction                28382 non-null  object
dtypes: float64(12), int64(6), object(3)
memory usage: 4.5+ MB

Checking Unique values in gender column in dataset

In [ ]:
df['gender'].unique()

array(['Male', nan, 'Female'], dtype=object)

Checking if any NAN values or missing values present

In [ ]:
df.isna().sum()

customer_id                          0
vintage                              0
age                                  0
gender                             525
dependents                        2463
occupation                          80
city                               803
customer_nw_category                 0
branch_code                          0
current_balance                      0
previous_month_end_balance           0
average_monthly_balance_prevQ        0
average_monthly_balance_prevQ2       0
current_month_credit                 0
previous_month_credit                0
current_month_debit                  0
previous_month_debit                 0
current_month_balance                0
previous_month_balance               0
churn                                0
last_transaction                     0
dtype: int64

In [ ]:
df = df.dropna(how='any')           # assign back
df.dropna(how='any', inplace=True)  # set inplace parameter

In [ ]:
df.head()

   customer_id  vintage  age  ... previous_month_balance  churn last_transaction
0            1     2101   66  ...                1458.71      0       2019-05-21
2            4     2194   31  ...                5070.14      0              NaT
4            6     1579   42  ...                1677.16      1       2019-11-03
5            7     1923   42  ...               15349.75      0       2019-11-01
6            8     2048   72  ...                7755.98      0       2019-09-24

[5 rows x 21 columns]

Mapping String values in gender column to integer values

In [ ]:
df['gender']=df['gender'].map({'Male':0,'Female':1})

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24832 entries, 0 to 28381
Data columns (total 21 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   customer_id                     24832 non-null  int64
 1   vintage                         24832 non-null  int64
 2   age                             24832 non-null  int64
 3   gender                          24832 non-null  int64
 4   dependents                      24832 non-null  float64
 5   occupation                      24832 non-null  object
 6   city                            24832 non-null  float64
 7   customer_nw_category            24832 non-null  int64
 8   branch_code                     24832 non-null  int64
 9   current_balance                 24832 non-null  float64
 10  previous_month_end_balance      24832 non-null  float64
 11  average_monthly_balance_prevQ   24832 non-null  float64
 12  average_monthly_balance_prevQ2  24832 non-null  float64
 13  current_month_credit            24832 non-null  float64
 14  previous_month_credit           24832 non-null  float64
 15  current_month_debit             24832 non-null  float64
 16  previous_month_debit            24832 non-null  float64
 17  current_month_balance           24832 non-null  float64
 18  previous_month_balance          24832 non-null  float64
 19  churn                           24832 non-null  int64
 20  last_transaction                24832 non-null  object
dtypes: float64(12), int64(7), object(2)
memory usage: 4.2+ MB

In [ ]:
df.isna().sum()

customer_id                       0
vintage                           0
age                               0
gender                            0
dependents                        0
occupation                        0
city                              0
customer_nw_category              0
branch_code                       0
current_balance                   0
previous_month_end_balance        0
average_monthly_balance_prevQ     0
average_monthly_balance_prevQ2    0
current_month_credit              0
previous_month_credit             0
current_month_debit               0
previous_month_debit              0
current_month_balance             0
previous_month_balance            0
churn                             0
last_transaction                  0
dtype: int64

In [ ]:
df.head()

   customer_id  vintage  age  ...  previous_month_balance  churn last_transaction
0            1     2101   66  ...                 1458.71      0       2019-05-21
2            4     2194   31  ...                 5070.14      0              NaT
4            6     1579   42  ...                 1677.16      1       2019-11-03
5            7     1923   42  ...                15349.75      0       2019-11-01
6            8     2048   72  ...                 7755.98      0       2019-09-24

[5 rows x 21 columns]

In [ ]:
df['occupation'].unique()

array(['self_employed', 'salaried', 'retired', 'student', 'company'],
      dtype=object)

In [ ]:
df['occupation']=df['occupation'].map({'self_employed':2, 'salaried':3, 'retired':5, 'student':1, 'company':4})
df.head()

   customer_id  vintage  age  ...  previous_month_balance  churn  last_transaction
0            1     2101   66  ...                 1458.71      0        2019-05-21
2            4     2194   31  ...                 5070.14      0               NaT
4            6     1579   42  ...                 1677.16      1        2019-11-03
5            7     1923   42  ...                15349.75      0        2019-11-01
6            8     2048   72  ...                 7755.98      0        2019-09-24

[5 rows x 21 columns]

In [ ]:
df['last_transaction'].unique()

array(['2019-05-21', 'NaT', '2019-11-03', '2019-11-01', '2019-09-24',
       '2019-07-12', '2019-12-12', '2019-12-31', '2019-12-26',
       '2019-12-11', '2019-11-14', '2019-03-03', '2019-11-09',
       '2019-12-28', '2019-10-23', '2019-11-30', '2019-12-08',
       '2019-12-18', '2019-12-27', '2019-12-22', '2019-12-04',
       '2019-11-25', '2019-08-28', '2019-10-15', '2019-12-21',
       '2019-09-25', '2019-12-05', '2019-09-22', '2019-12-24',
       '2019-12-20', '2019-07-24', '2019-12-17', '2019-09-27',
       '2019-12-14', '2019-09-06', '2019-10-16', '2019-12-13',
       '2019-12-03', '2019-12-06', '2019-07-11', '2019-11-15',
       '2019-12-19', '2019-12-25', '2019-08-15', '2019-08-27',
       '2019-11-12', '2019-05-15', '2019-11-16', '2019-10-17',
       '2019-05-26', '2019-10-22', '2019-12-01', '2019-07-04',
       '2019-11-22', '2019-06-26', '2019-10-11', '2019-03-09',
       '2019-10-29', '2019-07-10', '2019-09-26', '2019-09-20',
       '2019-11-21', '2019-07-20', '2019-09-12', '2019-05-14',
       '2019-10-05', '2019-11-26', '2019-10-06', '2019-11-13',
       '2019-08-24', '2019-10-31', '2019-06-09', '2019-04-18',
       '2019-12-10', '2019-08-21', '2019-06-05', '2019-11-08',
       '2019-12-07', '2019-08-18', '2019-08-04', '2019-03-20',
       '2019-08-16', '2019-07-16', '2019-09-14', '2019-02-26',
       '2019-11-23', '2019-05-18', '2019-11-06', '2019-10-24',
       '2019-09-13', '2019-09-04', '2019-01-08', '2019-10-20',
       '2019-01-24', '2019-09-19', '2019-06-14', '2019-04-17',
       '2019-08-29', '2019-10-30', '2019-11-05', '2019-10-03',
       '2019-10-01', '2019-08-07', '2019-11-17', '2019-11-20',
       '2019-08-02', '2019-08-30', '2019-10-07', '2019-09-05',
       '2019-10-02', '2019-09-07', '2019-12-02', '2019-10-04',
       '2019-02-15', '2019-02-27', '2019-10-13', '2019-08-01',
       '2019-03-14', '2019-07-17', '2019-05-08', '2019-06-28',
       '2019-11-19', '2019-12-15', '2019-10-19', '2019-12-30',
       '2019-10-12', '2019-07-21', '2019-07-22', '2019-06-02',
       '2019-03-08', '2019-09-03', '2019-05-12', '2019-10-21',
       '2019-02-14', '2019-11-28', '2019-02-21', '2019-06-21',
       '2019-01-29', '2019-06-27', '2019-07-06', '2019-06-07',
       '2019-09-18', '2019-07-25', '2019-08-26', '2019-04-16',
       '2019-08-08', '2019-03-06', '2019-11-29', '2019-03-16',
       '2019-07-09', '2019-10-09', '2019-12-16', '2019-07-30',
       '2019-11-24', '2019-04-19', '2019-04-07', '2019-11-02',
       '2019-06-13', '2019-11-18', '2019-12-09', '2019-01-19',
       '2019-10-27', '2019-03-22', '2019-06-22', '2019-04-09',
       '2019-08-14', '2019-08-09', '2019-02-05', '2019-06-29',
       '2019-07-05', '2019-04-28', '2019-01-15', '2019-07-03',
       '2019-03-29', '2019-08-17', '2019-07-13', '2019-05-23',
       '2019-08-31', '2019-09-08', '2019-05-25', '2019-04-26',
       '2019-05-29', '2019-08-20', '2019-05-11', '2019-06-18',
       '2019-11-04', '2019-07-02', '2019-01-18', '2019-04-23',
       '2019-10-18', '2019-01-02', '2019-02-02', '2019-07-26',
       '2019-09-21', '2019-05-09', '2019-07-31', '2019-03-01',
       '2019-11-27', '2019-05-01', '2019-05-17', '2019-09-11',
       '2019-10-25', '2019-11-07', '2019-05-30', '2019-09-17',
       '2019-06-04', '2019-12-23', '2019-05-07', '2019-04-20',
       '2019-02-23', '2019-04-03', '2019-09-28', '2019-03-05',
       '2019-01-30', '2019-01-26', '2019-02-04', '2019-03-19',
       '2019-06-08', '2019-04-04', '2019-06-25', '2019-07-18',
       '2019-08-13', '2019-08-22', '2019-04-27', '2019-06-30',
       '2019-01-04', '2019-06-01', '2019-10-08', '2018-12-31',
       '2019-04-02', '2019-08-10', '2019-06-23', '2019-01-23',
       '2019-09-01', '2019-02-17', '2019-03-23', '2019-12-29',
       '2019-09-15', '2019-06-20', '2019-04-06', '2019-07-28',
       '2019-09-10', '2019-03-30', '2019-05-24', '2019-07-19',
       '2019-01-22', '2019-03-26', '2019-04-12', '2019-03-28',
       '2019-06-19', '2019-11-11', '2019-03-27', '2019-05-16',
       '2019-06-12', '2019-01-06', '2019-02-16', '2019-04-24',
       '2019-02-20', '2019-05-05', '2019-01-16', '2019-11-10',
       '2019-03-13', '2019-05-31', '2019-02-25', '2019-04-21',
       '2019-05-04', '2019-07-27', '2019-04-30', '2019-02-24',
       '2019-07-23', '2019-09-09', '2019-09-23', '2019-03-07',
       '2019-03-15', '2019-06-11', '2019-08-06', '2019-07-07',
       '2019-02-12', '2019-04-25', '2019-04-11', '2019-06-15',
       '2019-06-06', '2019-01-13', '2019-04-15', '2019-04-05',
       '2019-02-01', '2019-05-02', '2019-04-08', '2019-03-10',
       '2019-02-10', '2019-07-01', '2019-04-13', '2019-05-28',
       '2019-08-23', '2019-03-12', '2019-03-21', '2019-05-22',
       '2019-03-02', '2019-01-25', '2019-02-08', '2019-09-30',
       '2019-03-11', '2019-02-03', '2019-01-03', '2019-03-17',
       '2019-04-10', '2019-01-27', '2019-02-22', '2019-02-09',
       '2019-01-10', '2019-02-07', '2019-01-09', '2019-03-24',
       '2019-09-29', '2019-05-03', '2019-10-14', '2019-08-05',
       '2019-08-03', '2019-06-16', '2019-09-16', '2019-10-26',
       '2019-01-20', '2019-05-10', '2019-05-19', '2019-05-06',
       '2019-01-12', '2019-01-11', '2019-02-28', '2019-09-02',
       '2019-01-21', '2019-07-29', '2019-01-28', '2019-01-05',
       '2019-04-01', '2019-04-29', '2019-02-06', '2019-03-18',
       '2019-06-24', '2019-04-14', '2019-10-28', '2019-02-19',
       '2019-01-17', '2019-08-12', '2019-01-01', '2019-03-31',
       '2019-08-19', '2019-06-17', '2019-07-08', '2019-05-27',
       '2019-06-03', '2019-10-10', '2019-02-11', '2019-01-14',
       '2019-02-13', '2019-03-04', '2019-07-14', '2019-08-25',
       '2019-07-15'], dtype=object)

Changing DD/MM/YY values to YY

In [ ]:
df['last_transaction']=pd.DatetimeIndex(df['last_transaction']).year

In [ ]:
df.head()

   customer_id  vintage  age  ...  previous_month_balance  churn  last_transaction
0            1     2101   66  ...                 1458.71      0            2019.0
2            4     2194   31  ...                 5070.14      0               NaN
4            6     1579   42  ...                 1677.16      1            2019.0
5            7     1923   42  ...                15349.75      0            2019.0
6            8     2048   72  ...                 7755.98      0            2019.0

[5 rows x 21 columns]

In [ ]:
df.dropna(inplace=True)

In [ ]:
df['last_transaction'].unique()

array([2019., 2018.])

In [ ]:
df['last_transaction']=df['last_transaction'].map({2019.: 1.0, 2018.: 0.0})

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22067 entries, 0 to 28381
Data columns (total 21 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   customer_id                     22067 non-null  int64
 1   vintage                         22067 non-null  int64
 2   age                             22067 non-null  int64
 3   gender                          22067 non-null  int64
 4   dependents                      22067 non-null  float64
 5   occupation                      22067 non-null  int64
 6   city                            22067 non-null  float64
 7   customer_nw_category            22067 non-null  int64
 8   branch_code                     22067 non-null  int64
 9   current_balance                 22067 non-null  float64
 10  previous_month_end_balance      22067 non-null  float64
 11  average_monthly_balance_prevQ   22067 non-null  float64
 12  average_monthly_balance_prevQ2  22067 non-null  float64
 13  current_month_credit            22067 non-null  float64
 14  previous_month_credit           22067 non-null  float64
 15  current_month_debit             22067 non-null  float64
 16  previous_month_debit            22067 non-null  float64
 17  current_month_balance           22067 non-null  float64
 18  previous_month_balance          22067 non-null  float64
 19  churn                           22067 non-null  int64
 20  last_transaction                22067 non-null  float64
dtypes: float64(13), int64(8)
memory usage: 3.7 MB

Checking for Class Imbalance in Target column

In [ ]:
df['churn'].value_counts() #Class Imbalance (here, no. of 0's > 1's)

0    17793
1     4274
Name: churn, dtype: int64

Scaling the dataset

In [ ]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
Y = df['churn']
X = scaler.fit_transform(df.drop(columns=['churn']))
X = pd.DataFrame(data = X,columns=df.drop(columns=['churn']).columns)

X : Dataset without target column

Y : Target Column

In [ ]:
X.head()

   customer_id   vintage  ...  previous_month_balance  last_transaction
0    -1.729866  0.038766  ...               -0.272852          0.009521
1    -1.729294 -1.869714  ...               -0.262438          0.009521
2    -1.729179 -0.612018  ...                0.389372          0.009521
3    -1.729065 -0.155007  ...                0.027356          0.009521
4    -1.728950 -0.297594  ...               -0.088915          0.009521

[5 rows x 20 columns]

Splitting dataset to test & train the data

In [ ]:
from sklearn.model_selection import train_test_split as tts
x_train,x_test,y_train,y_test = tts(X,Y,test_size = 0.3,random_state = 101)

Modelling Logistic Regression

In [ ]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression(class_weight='balanced') 
lr.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight='balanced', dual=False,
                   fit_intercept=True, intercept_scaling=1, l1_ratio=None,
                   max_iter=100, multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
predictedvalues=lr.predict(x_test)
predictedvalues

array([0, 0, 0, ..., 0, 1, 0])

In [ ]:
predicted_probabilities=lr.predict_proba(x_test)
predicted_probabilities

array([[0.65733286, 0.34266714],
       [0.5528913 , 0.4471087 ],
       [0.56181366, 0.43818634],
       ...,
       [0.5098113 , 0.4901887 ],
       [0.48050048, 0.51949952],
       [0.5754306 , 0.4245694 ]])

In [ ]:
from sklearn.metrics import roc_auc_score
roc_auc_score(y_test, predicted_probabilities[:,1]) #ROC Value(i.e Area under ROC curve)

0.7490098190611818

In [ ]:
from sklearn.metrics import confusion_matrix
cf = confusion_matrix(y_test, predictedvalues)
cf #confusion matrix

array([[4080, 1272],
       [ 479,  790]])

In [ ]:
lr.score(x_test, y_test) #accuracy

0.7355384383023712